zarutto_server/app/controllers/menus_controller.rb

SELECT "menus".* FROM "menus"
---
  def index
    render json: {status: 200, menu: Menu.all}

SELECT  "menus".* FROM "menus" WHERE "menus"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def show
    @menu_item = Menu.find(params[:id])

INSERT INTO "menus" ("course_type", "item_name", "price", "details", "style_type", "pieces", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"
---
  def create
    @menu_item = Menu.new(menu_params)
    if @menu_item.save

SELECT  "menus".* FROM "menus" WHERE "menus"."id" = $1 LIMIT $2  [["id", 53], ["LIMIT", 1]]
UPDATE "menus" SET "course_type" = $1, "style_type" = $2, "updated_at" = $3 WHERE "menus"."id" = $4  [["course_type", "Mains"], ["style_type", "Put"], ["updated_at", "2019-05-27 18:12:32.608400"], ["id", 53]]
---
  def update
    @menu_item = Menu.find(params[:id])
    @menu_item.update(menu_params)

DELETE FROM "menus" WHERE "menus"."id" = $1  [["id", 53]]
---
  def destroy
    @menu_item = Menu.destroy(params[:id])